Repository: Stanworld80/Colors_Notes
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, it, pt

# entryPageOriginalColorMissingSnackbar
source: This note's original color no longer exists in the palette. A default color has been selected.
de: Die Originalfarbe dieser Notiz existiert nicht mehr in der Palette. Eine Standardfarbe wurde ausgewählt.
es: El color original de esta nota ya no existe en la paleta. Se ha seleccionado un color predeterminado.
fr: La couleur d'origine de cette note n'existe plus dans la palette. Une couleur par défaut a été sélectionnée.
it: Il colore originale di questa nota non esiste più nella tavolozza. È stato selezionato un colore predefinito.
pt: A cor original desta nota já não existe na paleta. Foi selecionada uma cor predefinida.

# entryPagePaletteEmptySnackbar
source: This journal's palette is empty. Please add colors to the palette to associate this note.
de: Die Palette dieses Journals ist leer. Bitte fügen Sie Farben zur Palette hinzu, um diese Notiz zuzuordnen.
es: La paleta de este diario está vacía. Por favor, añade colores a la paleta para asociar esta nota.
fr: La palette de ce journal est vide. Veuillez ajouter des couleurs à la palette pour pouvoir associer cette note.
it: La tavolozza di questo diario è vuota. Aggiungi colori alla tavolozza per associare questa nota.
pt: A paleta deste jornal está vazia. Adicione cores à paleta para associar esta nota.

# entryPageSaveAsNewButton
source: Save as new note
de: Als neue Notiz speichern
es: Guardar como nueva nota
fr: Sauvegarder comme nouvelle note
it: Salva come nuova nota
pt: Guardar como nova nota

# entryPageSaveButtonCreate
source: Save Note
de: Notiz speichern
es: Guardar Nota
fr: Sauvegarder la Note
it: Salva Nota
pt: Guardar Nota

# entryPageSaveButtonUpdate
source: Update Note
de: Notiz aktualisieren
es: Actualizar Nota
fr: Mettre à jour la Note
it: Aggiorna Nota
pt: Atualizar Nota

# entryPageSaveTooltip
source: Save note
de: Notiz speichern
es: Guardar nota
fr: Sauvegarder la note
it: Salva nota
pt: Guardar nota

# entryPageSavingButton
source: Saving...
de: Speichern...
es: Guardando...
fr: Sauvegarde...
it: Salvataggio...
pt: A guardar...

# entryPageSelectColorValidator
source: Please select a color.
de: Bitte wählen Sie eine Farbe.
es: Por favor, selecciona un color.
fr: Veuillez choisir une couleur.
it: Seleziona un colore.
pt: Por favor, selecione uma cor.

# entryPageUpdateTooltip
source: Update note
de: Notiz aktualisieren
es: Actualizar nota
fr: Mettre à jour la note
it: Aggiorna nota
pt: Atualizar nota

# entryPageUserNotIdentifiedError
source: User not identified.
de: Benutzer nicht identifiziert.
es: Usuario no identificado.
fr: Utilisateur non identifié.
it: Utente non identificato.
pt: Utilizador não identificado.

source: Error
de: Fehler
fr: Erreur
it: Errore
pt: Erro

# errorAppBarTitle
source: Error
de: Fehler
fr: Erreur
it: Errore
pt: Erro

# errorCheckingColorUsageLog
source: Error checking color usage: {errorDetails}
de: Fehler beim Überprüfen der Farbverwendung: {errorDetails}
es: Error al comprobar el uso del color: {errorDetails}
fr: Erreur lors de la vérification de l'utilisation des couleurs : {errorDetails}
it: Errore durante la verifica dell'utilizzo del colore: {errorDetails}
pt: Erro ao verificar o uso da cor: {errorDetails}

# errorCheckingColorUsageSnackbar
source: Error checking color usage: {errorDetails}
de: Fehler beim Überprüfen der Farbverwendung: {errorDetails}
es: Error al comprobar el uso del color: {errorDetails}
fr: Erreur vérification utilisation couleur : {errorDetails}
it: Errore verifica utilizzo colore: {errorDetails}
pt: Erro ao verificar uso da cor: {errorDetails}

# errorDeletingAllColorsNotesLog
source: Error deleting all colors/notes: {errorDetails}
de: Fehler beim Löschen aller Farben/Notizen: {errorDetails}
es: Error al eliminar todos los colores/notas: {errorDetails}
fr: Erreur lors de la suppression de toutes les couleurs/notes : {errorDetails}
it: Errore durante l'eliminazione di tutti i colori/note: {errorDetails}
pt: Erro ao eliminar todas as cores/notas: {errorDetails}

# errorDeletingAllNotesSnackbar
source: Error deleting all notes: {errorDetails}
de: Fehler beim Löschen aller Notizen: {errorDetails}
es: Error al eliminar todas las notas: {errorDetails}
fr: Erreur lors de la suppression de toutes les notes : {errorDetails}
it: Errore durante l'eliminazione di tutte le note: {errorDetails}
pt: Erro ao eliminar todas as notas: {errorDetails}

# errorDeletingJournalSnackbar
source: Error deleting: {errorDetails}
de: Fehler beim Löschen: {errorDetails}
es: Error al eliminar: {errorDetails}
fr: Erreur de suppression : {errorDetails}
it: Errore durante l'eliminazione: {errorDetails}
pt: Erro ao eliminar: {errorDetails}

# errorDeletingModelSnackbar
source: Error deleting: {errorDetails}
de: Fehler beim Löschen: {errorDetails}
es: Error al eliminar: {errorDetails}
fr: Erreur de suppression : {errorDetails}
it: Errore durante l'eliminazione: {errorDetails}
pt: Erro ao eliminar: {errorDetails}

# errorDeletingNoteSnackbar
source: Error during deletion: {errorDetails}
de: Fehler beim Löschen: {errorDetails}
es: Error durante la eliminación: {errorDetails}
fr: Erreur lors de la suppression : {errorDetails}
it: Errore durante l'eliminazione: {errorDetails}
pt: Erro durante a eliminação: {errorDetails}

# errorLaunchingUrl
source: loading error
de: Ladefehler
es: error de carga
fr: erreur de chargement
it: Errore durante l'apertura dell'URL
pt: Erro ao carregar URL

# errorLoadingInitialData
source: Error loading initial data: {errorDetails}
de: Fehler beim Laden der Initialdaten: {errorDetails}
es: Error al cargar los datos iniciales: {errorDetails}
fr: Erreur lors du chargement des données initiales : {errorDetails}
it: Errore durante il caricamento dei dati iniziali: {errorDetails}
pt: Erro ao carregar dados iniciais: {errorDetails}

source: Error loading journal:
de: Fehler beim Laden des Journals:
es: Error al cargar el diario:
fr: Erreur de chargement du journal :
it: Errore durante il caricamento del diario:
pt: Erro ao carregar jornal:

# errorLoadingJournals
source: Error loading journals: {errorDetails}
de: Fehler beim Laden der Journale: {errorDetails}
es: Error al cargar los diarios: {errorDetails}
fr: Erreur de chargement des journaux : {errorDetails}
it: Errore durante il caricamento dei diari: {errorDetails}
pt: Erro ao carregar jornais: {errorDetails}

# errorLoadingLicense
source: Error loading the license. Verify that the LICENSE file exists at the root of the project and is declared in the pubspec.yaml assets if necessary. Error: {errorDetails}
de: Fehler beim Laden der Lizenz. Überprüfen Sie, ob die LICENSE-Datei im Stammverzeichnis des Projekts vorhanden ist und ggf. in den Assets der pubspec.yaml deklariert ist. Fehler: {errorDetails}
es: Error al cargar la licencia. Verifica que el archivo LICENSE exista en la raíz del proyecto y esté declarado en los activos de pubspec.yaml si es necesario. Error: {errorDetails}
fr: Erreur de chargement de la licence. Vérifiez que le fichier LICENSE existe à la racine du projet et est déclaré dans les assets de pubspec.yaml si nécessaire. Erreur : {errorDetails}
it: Errore durante il caricamento della licenza. Verifica che il file LICENSE esista nella root del progetto e sia dichiarato negli assets di pubspec.yaml se necessario. Errore: {errorDetails}
pt: Erro ao carregar a licença. Verifique se o ficheiro LICENSE existe na raiz do projeto e está declarado nos assets do pubspec.yaml, se necessário. Erro: {errorDetails}

# errorLoadingNotes
source: Error loading notes. {errorDetails}
de: Fehler beim Laden der Notizen. {errorDetails}
es: Error al cargar las notas. {errorDetails}
fr: Erreur de chargement des notes. {errorDetails}
it: Errore durante il caricamento delle note. {errorDetails}
pt: Erro ao carregar notas. {errorDetails}

# errorLoadingOptions
source: Error loading options: {errorDetails}
de: Fehler beim Laden der Optionen: {errorDetails}
es: Error al cargar las opciones: {errorDetails}
fr: Erreur chargement des options : {errorDetails}
it: Errore durante il caricamento delle opzioni: {errorDetails}
pt: Erro ao carregar opções: {errorDetails}

source: Error loading personal models.
de: Fehler beim Laden persönlicher Modelle.
es: Error al cargar los modelos personales.
fr: Erreur de chargement des modèles personnels.
it: Errore durante il caricamento dei modelli personali.
pt: Erro ao carregar modelos pessoais.

# errorSavingPaletteSnackbar
source: Error saving: {errorDetails}
de: Fehler beim Speichern: {errorDetails}
es: Error al guardar: {errorDetails}
fr: Erreur de sauvegarde : {errorDetails}
it: Errore durante il salvataggio: {errorDetails}
pt: Erro ao guardar: {errorDetails}

# errorTitle
source: Error
de: Fehler
fr: Erreur
it: Errore
pt: Erro

source: Error: User not identified.
de: Fehler: Benutzer nicht identifiziert.
es: Error: Usuario no identificado.
fr: Erreur : Utilisateur non identifié.
it: Errore: Utente non identificato.
pt: Erro: Utilizador não identificado.

# existingJournalsSectionTitle
source: Existing Journals:
de: Vorhandene Journale:
es: Diarios Existentes:
fr: Journaux Existants :
it: Diari Esistenti:
pt: Jornais Existentes:

source: Field cannot be empty.
de: Feld darf nicht leer sein.
es: El campo no puede estar vacío.
fr: Le champ ne peut pas être vide.
it: Il campo non può essere vuoto.
pt: O campo não pode estar vazio.

# finalConfirmationDialogContent
source: To confirm deletion, please type 'DELETE' in the field below.
de: Zur Bestätigung der Löschung geben Sie bitte 'DELETE' in das Feld unten ein.
es: Para confirmar la eliminación, escribe 'DELETE' en el campo de abajo.
fr: Pour confirmer la suppression, veuillez taper 'DELETE' dans le champ ci-dessous.
it: Per confermare l'eliminazione, digita 'DELETE' nel campo sottostante.
pt: Para confirmar a eliminação, por favor escreva 'ELIMINAR' no campo abaixo.

# finalConfirmationDialogTitle
source: FINAL CONFIRMATION for "{journalName}"
de: ENDGÜLTIGE BESTÄTIGUNG für "{journalName}"
es: CONFIRMACIÓN FINAL para "{journalName}"
fr: CONFIRMATION FINALE pour "{journalName}"
it: CONFERMA FINALE per "{journalName}"
pt: CONFIRMAÇÃO FINAL para "{journalName}"

# finalDeleteAllConfirmationDialogContent
source: Are you absolutely sure? This action is IRREVERSIBLE.
de: Sind Sie absolut sicher? Diese Aktion ist UNWIDERRUFLICH.
es: ¿Estás absolutamente seguro? Esta acción es IRREVERSIBLE.
fr: Êtes-vous absolument sûr(e) ? Cette action est IRRÉVERSIBLE.
it: Sei assolutamente sicuro? Questa azione è IRREVERSIBILE.
pt: Tem a certeza absoluta? Esta ação é IRREVERSÍVEL.

# finalDeleteAllConfirmationDialogTitle
source: FINAL CONFIRMATION
de: ENDGÜLTIGE BESTÄTIGUNG
es: CONFIRMACIÓN FINAL
fr: CONFIRMATION FINALE
it: CONFERMA FINALE
pt: CONFIRMAÇÃO FINAL

# finalDeleteAllConfirmationJournalWarning
source: Are you absolutely sure? Deleting colors from this palette will IRREVERSIBLY delete ALL notes in this journal.
de: Sind Sie absolut sicher? Das Löschen von Farben aus dieser Palette löscht UNWIDERRUFLICH ALLE Notizen in diesem Journal.
es: ¿Estás absolutamente seguro? Eliminar colores de esta paleta eliminará IRREVERSIBLEMENTE TODAS las notas de este diario.
fr: Êtes-vous absolument sûr(e) ? La suppression des couleurs de cette palette supprimera IRRÉVERSIBLEMENT TOUTES les notes de ce journal.
it: Sei assolutamente sicuro? L'eliminazione dei colori da questa tavolozza eliminerà IRREVERSIBILMENTE TUTTE le note in questo diario.
pt: Tem a certeza absoluta? Eliminar as cores desta paleta irá eliminar IRREVERSIVELMENTE TODAS as notas deste jornal.

# finalDeleteAllConfirmationModelWarning
source: Do you confirm deleting all colors from this model?
de: Bestätigen Sie das Löschen aller Farben aus diesem Modell?
es: ¿Confirmas la eliminación de todos los colores de este modelo?
fr: Confirmez-vous la suppression de toutes les couleurs de ce modèle ?
it: Confermi l'eliminazione di tutti i colori da questo modello?
pt: Confirma a eliminação de todas as cores deste modelo?

# formValidationFailedLog
source: Form validation (palette name) failed during auto-save.
de: Formularvalidierung (Palettenname) während des automatischen Speicherns fehlgeschlagen.
es: La validación del formulario (nombre de la paleta) falló durante el guardado automático.
fr: La validation du formulaire (nom de la palette) a échoué lors de la sauvegarde automatique.
it: La convalida del modulo (nome tavolozza) è fallita durante il salvataggio automatico.
pt: A validação do formulário (nome da paleta) falhou durante a gravação automática.

source: French
de: Französisch
it: Francese
pt: Francês

# generatedColorExistsError
source: Generated color {hexCode} already exists.
de: Generierte Farbe {hexCode} existiert bereits.
es: El color generado {hexCode} ya existe.
fr: La couleur générée {hexCode} existe déjà.
it: Il colore generato {hexCode} esiste già.
pt: A cor gerada {hexCode} já existe.

# generatedTitleExistsError
source: Generated title "{title}" already exists.
de: Generierter Titel "{title}" existiert bereits.
es: El título generado "{title}" ya existe.
fr: Le titre généré "{title}" existe déjà.
it: Il titolo generato "{title}" esiste già.
pt: O título gerado "{title}" já existe.

# genericAuthErrorSnackbar
source: Authentication error: Please try again.
de: Authentifizierungsfehler: Bitte versuchen Sie es erneut.
es: Error de autenticación: Por favor, inténtalo de nuevo.
fr: Erreur d'authentification : Veuillez réessayer.
it: Errore di autenticazione: Riprova.
pt: Erro de autenticação: Por favor, tente novamente.

# genericErrorSnackbar
source: Error: {errorDetails}
de: Fehler: {errorDetails}
fr: Erreur : {errorDetails}
it: Errore: {errorDetails}
pt: Erro: {errorDetails}

# incorrectConfirmationTextValidator
source: Incorrect confirmation text.
de: Falscher Bestätigungstext.
es: Texto de confirmación incorrecto.
fr: Texte de confirmation incorrect.
it: Testo di conferma errato.
pt: Texto de confirmação incorreto.

source: Invalid email.
de: Ungültige E-Mail.
es: Correo electrónico no válido.
fr: Email invalide.
it: Email non valida.
pt: Email inválido.

source: Invalid input
de: Ungültige Eingabe
es: Entrada no válida
fr: Entrée invalide
it: Input non valido
pt: Entrada inválida

source: Italian
de: Italienisch
it: Italiano
pt: Italiano

# journalCreatedOnDateLabel
source: Created on: {date}
de: Erstellt am: {date}
es: Creado el: {date}
fr: Créé le : {date}
it: Creato il: {date}
pt: Criado em: {date}

# journalCreatedSuccess
source: Journal "{journalName}" created successfully!
de: Journal "{journalName}" erfolgreich erstellt!
es: ¡Diario "{journalName}" creado con éxito!
fr: Journal "{journalName}" créé avec succès !
it: Diario "{journalName}" creato con successo!
pt: Jornal "{journalName}" criado com sucesso!

# journalDeletedSnackbar
source: Journal "{journalName}" deleted.
de: Journal "{journalName}" gelöscht.
es: Diario "{journalName}" eliminado.
fr: Journal "{journalName}" supprimé.
it: Diario "{journalName}" eliminato.
pt: Jornal "{journalName}" eliminado.

# journalDetailsUnavailableWarning
source: Journal details (for palette) not available for {journalId}. Color sorting may not work correctly.
de: Journaldetails (für Palette) für {journalId} nicht verfügbar. Farbsortierung funktioniert möglicherweise nicht korrekt.
es: Detalles del diario (para la paleta) no disponibles para {journalId}. La ordenación por color puede no funcionar correctamente.
fr: Les détails du journal (pour la palette) ne sont pas disponibles pour {journalId}. Le tri par couleur pourrait ne pas fonctionner correctement.
it: I dettagli del diario (per la tavolozza) non sono disponibili per {journalId}. L'ordinamento per colore potrebbe non funzionare correttamente.
pt: Detalhes do jornal (para paleta) não disponíveis para {journalId}. A ordenação por cores pode não funcionar corretamente.

# journalNameExistsError
source: A journal named "{journalName}" already exists.
de: Ein Journal mit dem Namen "{journalName}" existiert bereits.
es: Un diario llamado "{journalName}" ya existe.
fr: Un journal nommé "{journalName}" existe déjà.
it: Un diario chiamato "{journalName}" esiste già.
pt: Já existe um jornal com o nome "{journalName}".

# journalNameExistsSnackbar
source: A journal named "{journalName}" already exists.
de: Ein Journal mit dem Namen "{journalName}" existiert bereits.
es: Un diario llamado "{journalName}" ya existe.
fr: Un journal nommé "{journalName}" existe déjà.
it: Un diario chiamato "{journalName}" esiste già.
pt: Já existe um jornal com o nome "{journalName}".

# journalNameTextFieldHint
source: Ex: Gratitude Journal, Projects 2025...
de: Z.B.: Dankbarkeitstagebuch, Projekte 2025...
es: Ej: Diario de Gratitud, Proyectos 2025...
fr: Ex : Journal de gratitude, Projets 2025...
it: Es: Diario della gratitudine, Progetti 2025...
pt: Ex: Diário de Gratidão, Projetos 2025...

# journalNameTextFieldLabel
source: Choose a name for your journal...
de: Wählen Sie einen Namen für Ihr Journal...
es: Elige un nombre para tu diario...
fr: Choisissez un nom pour votre journal...
it: Scegli un nome per il tuo diario...
pt: Escolha um nome para o seu jornal...

# journalNameTooLongValidator
source: Journal name is too long (max 70).
de: Journalname ist zu lang (max. 70).
es: El nombre del diario es demasiado largo (máx. 70).
fr: Le nom du journal est trop long (max 70).
it: Il nome del diario è troppo lungo (max 70).
pt: O nome do jornal é demasiado longo (máx. 70).

# journalNameUpdatedSnackbar
source: Journal name updated.
de: Journalname aktualisiert.
es: Nombre del diario actualizado.
fr: Nom du journal mis à jour.
it: Nome del diario aggiornato.
pt: Nome do jornal atualizado.

# journalNameValidatorEmpty
source: Please enter a name for the journal.
de: Bitte geben Sie einen Namen für das Journal ein.
es: Por favor, introduce un nombre para el diario.
fr: Veuillez entrer un nom pour le journal.
it: Inserisci un nome per il diario.
pt: Por favor, introduza um nome para o jornal.

# journalNameValidatorTooLong
source: Journal name is too long (max 70).
de: Journalname ist zu lang (max. 70).
es: El nombre del diario es demasiado largo (máx. 70).
fr: Le nom du journal est trop long (max 70).
it: Il nome del diario è troppo lungo (max 70).
pt: O nome do jornal é demasiado longo (máx. 70).

# journalOptionsDialogTitle
source: Journal options
de: Journaloptionen
es: Opciones del diario
fr: Options du journal
it: Opzioni diario
pt: Opções do jornal

# journalPaletteSavedSnackbar
source: Journal palette saved.
de: Journalpalette gespeichert.
es: Paleta del diario guardada.
fr: Palette du journal sauvegardée.
it: Tavolozza del diario salvata.
pt: Paleta do jornal guardada.

# journalPaletteUpdatedLog
source: Palette for journal {journalName} updated.
de: Palette für Journal {journalName} aktualisiert.
es: Paleta para el diario {journalName} actualizada.
fr: La palette du journal {journalName} a été mise à jour.
it: Tavolozza per il diario {journalName} aggiornata.
pt: Paleta para o jornal {journalName} atualizada.

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
pt: Idioma

# licenseLink
source: License
de: Lizenz
es: Licencia
fr: Licence
it: Licenza
pt: Licença

# licensePageTitle
source: License Agreement
de: Lizenzvereinbarung
es: Acuerdo de Licencia
fr: Contrat de Licence
it: Contratto di Licenza
pt: Contrato de Licença

source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
pt: A carregar...

# loadingAppBarTitle
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
pt: A carregar...

source: Loading license...
de: Lizenz wird geladen...
es: Cargando licencia...
fr: Chargement de la licence...
it: Caricamento licenza...
pt: A carregar licença...

# loadingText
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
pt: A carregar...

# loadingTitle
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
pt: A carregar...

source: Logout
de: Abmelden
es: Cerrar sesión
fr: Déconnexion
it: Esci
pt: Terminar Sessão

source: Manage Journals
de: Journale verwalten
es: Gestionar Diarios
fr: Gérer les journaux
it: Gestisci Diari
pt: Gerir Jornais

# manageJournalsAppBarTitle
source: Manage Journals
de: Journale verwalten
es: Gestionar Diarios
fr: Gérer les Journaux
it: Gestisci Diari
pt: Gerir Jornais

source: Manage Palette Models
de: Palettenmodelle verwalten
es: Gestionar Modelos de Paleta
fr: Gérer les modèles de palettes
it: Gestisci Modelli di Tavolozze
pt: Gerir Modelos de Paleta

# managePaletteModelsAppBarTitle
source: Manage Palette Models
de: Palettenmodelle verwalten
es: Gestionar Modelos de Paleta
fr: Gérer les Modèles de Palette
it: Gestisci Modelli di Tavolozze
pt: Gerir Modelos de Paleta

# modelDeletedSnackbar
source: Model "{modelName}" deleted.
de: Modell "{modelName}" gelöscht.
es: Modelo "{modelName}" eliminado.
fr: Modèle "{modelName}" supprimé.
it: Modello "{modelName}" eliminato.
pt: Modelo "{modelName}" eliminado.

# modelMinColorsDeleteError
source: A palette model must contain at least {minColors} color(s). Cannot delete "{colorTitle}".
de: Ein Palettenmodell muss mindestens {minColors} Farbe(n) enthalten. "{colorTitle}" kann nicht gelöscht werden.
es: Un modelo de paleta debe contener al menos {minColors} color(es). No se puede eliminar "{colorTitle}".
fr: Un modèle de palette doit contenir au moins {minColors} couleur(s). Impossible de supprimer "{colorTitle}".
it: Un modello di tavolozza deve contenere almeno {minColors} colore/i. Impossibile eliminare "{colorTitle}".
pt: Um modelo de paleta deve conter pelo menos {minColors} cor(es). Não é possível eliminar "{colorTitle}".

# modelMinColorsErrorSnackbar
source: A model must have at least {minColors} colors.
de: Ein Modell muss mindestens {minColors} Farben haben.
es: Un modelo debe tener al menos {minColors} colores.
fr: Un modèle doit avoir au moins {minColors} couleurs.
it: Un modello deve avere almeno {minColors} colori.
pt: Um modelo deve ter pelo menos {minColors} cores.

# moreInfoText
source: For more information, consult the GitHub repository or the license page.
de: Weitere Informationen finden Sie im GitHub-Repository oder auf der Lizenzseite.
es: Para más información, consulta el repositorio de GitHub o la página de licencia.
fr: Pour plus d'informations, consultez le dépôt GitHub ou la page de licence.
it: Per maggiori informazioni, consulta il repository GitHub o la pagina della licenza.
pt: Para mais informações, consulte o repositório GitHub ou a página da licença.

# nameCannotBeEmptyValidator
source: Name cannot be empty.
de: Name darf nicht leer sein.
es: El nombre no puede estar vacío.
fr: Le nom ne peut pas être vide.
it: Il nome non può essere vuoto.
pt: O nome não pode estar vazio.

source: Name too long.
de: Name zu lang.
es: Nombre demasiado largo.
fr: Nom trop long.
it: Nome troppo lungo.
pt: Nome demasiado longo.

# newJournalNameHint
source: Enter the new name here
de: Geben Sie hier den neuen Namen ein
es: Introduce el nuevo nombre aquí
fr: Entrez le nouveau nom ici
it: Inserisci qui il nuovo nome
pt: Introduza o novo nome aqui

# newJournalNameLabel
source: New journal name
de: Neuer Journalname
es: Nuevo nombre del diario
fr: Nouveau nom du journal
it: Nuovo nome del diario
pt: Novo nome do jornal

# newNameSameAsOldValidator
source: The new name is identical to the old one.
de: Der neue Name ist identisch mit dem alten.
es: El nuevo nombre es idéntico al anterior.
fr: Le nouveau nom est identique à l'ancien.
it: Il nuovo nome è identico a quello vecchio.
pt: O novo nome é idêntico ao antigo.

# newPaletteDefaultName
source: New Palette
de: Neue Palette
es: Nueva Paleta
fr: Nouvelle Palette
it: Nuova Tavolozza
pt: Nova Paleta
