Repository: Stanworld80/Colors_Notes
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, it, pt

# newPaletteModelCreatedLog
source: New palette model created: {modelName}
de: Neues Palettenmodell erstellt: {modelName}
es: Nuevo modelo de paleta creado: {modelName}
fr: Nouveau modèle de palette créé : {modelName}
it: Nuovo modello di tavolozza creato: {modelName}
pt: Novo modelo de paleta criado: {modelName}

source: No account yet? Sign Up
de: Noch kein Konto? Registrieren
es: ¿Aún no tienes cuenta? Regístrate
fr: Pas encore de compte ? S'inscrire
it: Non hai ancora un account? Registrati
pt: Ainda não tem conta? Registar

# noActiveJournalMessage
source: Select an existing journal or create a new one to get started.
de: Wählen Sie ein vorhandenes Journal aus oder erstellen Sie ein neues, um zu beginnen.
es: Selecciona un diario existente o crea uno nuevo para empezar.
fr: Sélectionnez un journal existant ou créez-en un nouveau pour commencer.
it: Seleziona un diario esistente o creane uno nuovo per iniziare.
pt: Selecione um jornal existente ou crie um novo para começar.

# noActiveJournalTitle
source: No active journal.
de: Kein aktives Journal.
es: No hay diario activo.
fr: Aucun journal actif.
it: Nessun diario attivo.
pt: Nenhum jornal ativo.

# noCancelButtonLabel
source: NO, CANCEL
de: NEIN, ABBRECHEN
es: NO, CANCELAR
fr: NON, ANNULER
it: NO, ANNULLA
pt: NÃO, CANCELAR

# noExistingJournalsMessage
source: No existing journals.
de: Keine vorhandenen Journale.
es: No hay diarios existentes.
fr: Aucun journal existant.
it: Nessun diario esistente.
pt: Nenhum jornal existente.

source: No existing journals to copy.
de: Keine vorhandenen Journale zum Kopieren.
es: No hay diarios existentes para copiar.
fr: Aucun journal existant à copier.
it: Nessun diario esistente da cui copiare.
pt: Nenhum jornal existente para copiar.

# noNotesInJournalMessage
source: No notes in this journal.
de: Keine Notizen in diesem Journal.
es: No hay notas en este diario.
fr: Aucune note dans ce journal.
it: Nessuna nota in questo diario.
pt: Nenhuma nota neste jornal.

source: No palette models available.
de: Keine Palettenmodelle verfügbar.
es: No hay modelos de paleta disponibles.
fr: Aucun modèle de palette disponible.
it: Nessun modello di tavolozza disponibile.
pt: Nenhum modelo de paleta disponível.

# noPaletteModelsAvailableMessage
source: No palette models available.
de: Keine Palettenmodelle verfügbar.
es: No hay modelos de paleta disponibles.
fr: Aucun modèle de palette disponible.
it: Nessun modello di tavolozza disponibile.
pt: Nenhum modelo de paleta disponível.

# noRealChangesDetectedLog
source: No real changes detected, automatic save cancelled.
de: Keine wirklichen Änderungen erkannt, automatisches Speichern abgebrochen.
es: No se detectaron cambios reales, guardado automático cancelado.
fr: Aucun changement réel détecté, sauvegarde automatique annulée.
it: Nessuna modifica reale rilevata, salvataggio automatico annullato.
pt: Nenhuma alteração real detetada, gravação automática cancelada.

# noteCreatedOnLabel
source: Created on: {date}
de: Erstellt am: {date}
es: Creado el: {date}
fr: Créé le : {date}
it: Creata il: {date}
pt: Criada em: {date}

# noteDateLabel
source: Date: {date}
de: Datum: {date}
es: Fecha: {date}
it: Data: {date}
pt: Data: {date}

# noteDeletedSuccessSnackbar
source: Note successfully deleted.
de: Notiz erfolgreich gelöscht.
es: Nota eliminada con éxito.
fr: Note supprimée avec succès.
it: Nota eliminata con successo.
pt: Nota eliminada com sucesso.

# notificationSettingsComingSoon
source: Notification settings are coming soon!
de: Benachrichtigungseinstellungen folgen in Kürze!
es: ¡La configuración de notificaciones llegará pronto!
fr: Les paramètres de notification arrivent bientôt !
it: Impostazioni notifiche prossimamente!
pt: Definições de notificação em breve!

source: Notifications
de: Benachrichtigungen
es: Notificaciones
it: Notifiche
pt: Notificações

# numberBetweenValidator
source: Between 1 and {maxGradientSteps}.
de: Zwischen 1 und {maxGradientSteps}.
es: Entre 1 y {maxGradientSteps}.
fr: Entre 1 et {maxGradientSteps}.
it: Tra 1 e {maxGradientSteps}.
pt: Entre 1 e {maxGradientSteps}.

# numberOfColorsLabel
source: Number of colors (1 for single, 2-{maxGradientSteps} for gradient)
de: Anzahl der Farben (1 für einzelne, 2-{maxGradientSteps} für Verlauf)
es: Número de colores (1 para individual, 2-{maxGradientSteps} para gradiente)
fr: Nombre de couleurs (1 pour unique, 2-{maxGradientSteps} pour dégradé)
it: Numero di colori (1 per singolo, 2-{maxGradientSteps} per gradiente)
pt: Número de cores (1 para simples, 2-{maxGradientSteps} para gradiente)

# optionsAppBarTooltip
source: Options
de: Optionen
es: Opciones
it: Opzioni
pt: Opções

# optionsTooltip
source: Options
de: Optionen
es: Opciones
it: Opzioni
pt: Opções

# orSeparator
source: or
de: oder
es: o
fr: ou
it: o
pt: ou

# pageTitleModelPrefix
source: Model:
de: Modell:
es: Modelo:
fr: Modèle :
it: Modello:
pt: Modelo:

# pageTitleNewPaletteModel
source: New Palette Model
de: Neues Palettenmodell
es: Nuevo Modelo de Paleta
fr: Nouveau Modèle de Palette
it: Nuovo Modello di Tavolozza
pt: Novo Modelo de Paleta

# pageTitlePalettePrefix
source: Palette:
es: Paleta:
it: Tavolozza:
pt: Paleta:

# paletteCopiedFromName
source: Palette of '{journalName}' (Copied from {sourceJournalName})
de: Palette von '{journalName}' (Kopiert von {sourceJournalName})
es: Paleta de '{journalName}' (Copiada de {sourceJournalName})
fr: Palette de '{journalName}' (Copiée de {sourceJournalName})
it: Tavolozza di '{journalName}' (Copiata da {sourceJournalName})
pt: Paleta de '{journalName}' (Copiada de {sourceJournalName})

# paletteCopiedFromNameNoJournal
source: Palette (Copied from {sourceJournalName})
de: Palette (Kopiert von {sourceJournalName})
es: Paleta (Copiada de {sourceJournalName})
fr: Palette (Copiée de {sourceJournalName})
it: Tavolozza (Copiata da {sourceJournalName})
pt: Paleta (Copiada de {sourceJournalName})

# paletteEmptyMaxReachedMessage
source: The palette is empty and has reached the maximum number of colors.
de: Die Palette ist leer und hat die maximale Anzahl an Farben erreicht.
es: La paleta está vacía y ha alcanzado el número máximo de colores.
fr: La palette est vide et a atteint le nombre maximum de couleurs.
it: La tavolozza è vuota e ha raggiunto il numero massimo di colori.
pt: A paleta está vazia e atingiu o número máximo de cores.

# paletteFromModelName
source: Palette of '{journalName}' (Model: {modelName})
de: Palette von '{journalName}' (Modell: {modelName})
es: Paleta de '{journalName}' (Modelo: {modelName})
fr: Palette de '{journalName}' (Modèle : {modelName})
it: Tavolozza di '{journalName}' (Modello: {modelName})
pt: Paleta de '{journalName}' (Modelo: {modelName})

# paletteFromModelNameNoJournal
source: Palette (Model: {modelName})
de: Palette (Modell: {modelName})
es: Paleta (Modelo: {modelName})
fr: Palette (Modèle : {modelName})
it: Tavolozza (Modello: {modelName})
pt: Paleta (Modelo: {modelName})

# paletteIsEmptyMessage
source: This journal's palette is empty. Edit the journal to add colors, or choose another journal.
de: Die Palette dieses Journals ist leer. Bearbeiten Sie das Journal, um Farben hinzuzufügen, oder wählen Sie ein anderes Journal.
es: La paleta de este diario está vacía. Edita el diario para añadir colores o elige otro diario.
fr: La palette de ce journal est vide. Modifiez le journal pour ajouter des couleurs, ou choisissez un autre journal.
it: La tavolozza di questo diario è vuota. Modifica il diario per aggiungere colori o scegline un altro.
pt: A paleta deste jornal está vazia. Edite o jornal para adicionar cores ou escolha outro jornal.

# paletteMaxColorsError
source: The palette cannot have more than {maxColors} colors.
de: Die Palette darf nicht mehr als {maxColors} Farben enthalten.
es: La paleta no puede tener más de {maxColors} colores.
fr: La palette ne peut pas avoir plus de {maxColors} couleurs.
it: La tavolozza non può avere più di {maxColors} colori.
pt: A paleta não pode ter mais de {maxColors} cores.

# paletteMaxColorsErrorSnackbar
source: A palette cannot have more than {maxColors} colors.
de: Eine Palette darf nicht mehr als {maxColors} Farben haben.
es: Una paleta no puede tener más de {maxColors} colores.
fr: Une palette ne peut pas avoir plus de {maxColors} couleurs.
it: Una tavolozza non può avere più di {maxColors} colori.
pt: Uma paleta não pode ter mais de {maxColors} cores.

# paletteMinColorError
source: The palette must contain at least 1 color.
de: Die Palette muss mindestens 1 Farbe enthalten.
es: La paleta debe contener al menos 1 color.
fr: La palette doit contenir au moins 1 couleur.
it: La tavolozza deve contenere almeno 1 colore.
pt: A paleta deve conter pelo menos 1 cor.

# paletteMinColorsError
source: The palette must contain at least {minColors} color(s).
de: Die Palette muss mindestens {minColors} Farbe(n) enthalten.
es: La paleta debe contener al menos {minColors} color(es).
fr: La palette doit contenir au moins {minColors} couleur(s).
it: La tavolozza deve contenere almeno {minColors} colore/i.
pt: A paleta deve conter pelo menos {minColors} cor(es).

# paletteModelInfo
source: {colorCount} color{pluralS} {type}
de: {colorCount} Farbe{pluralS} {type}
fr: {colorCount} couleur{pluralS} {type}
it: {colorCount,plural, =1{colore} other{colori}} {type}
pt: {colorCount,plural, =1{cor} other{cores}} {type}

# paletteModelNameExistsError
source: A palette model with this name already exists.
de: Ein Palettenmodell mit diesem Namen existiert bereits.
es: Un modelo de paleta con este nombre ya existe.
fr: Un modèle de palette avec ce nom existe déjà.
it: Un modello di tavolozza con questo nome esiste già.
pt: Já existe um modelo de paleta com este nome.

# paletteModelSavedSnackbar
source: Palette model saved.
de: Palettenmodell gespeichert.
es: Modelo de paleta guardado.
fr: Modèle de palette sauvegardé.
it: Modello di tavolozza salvato.
pt: Modelo de paleta guardado.

# paletteModelSuffixPersonal
source: (Personal)
de: (Persönlich)
fr: (Personnel)
it: (Personale)
pt: (Pessoal)

# paletteModelSuffixPredefined
source: (Predefined)
de: (Vordefiniert)
es: (Predefinido)
fr: (Prédéfini)
it: (Predefinito)
pt: (Predefinido)

# paletteModelUpdatedLog
source: Palette model updated: {modelName}
de: Palettenmodell aktualisiert: {modelName}
es: Modelo de paleta actualizado: {modelName}
fr: Modèle de palette mis à jour : {modelName}
it: Modello di tavolozza aggiornato: {modelName}
pt: Modelo de paleta atualizado: {modelName}

# paletteModelsAppBarTitle
source: Palette Models
de: Palettenmodelle
es: Modelos de Paleta
fr: Modèles de Palette
it: Modelli di Tavolozze
pt: Modelos de Paleta

# paletteNameEmptyValidator
source: Palette name cannot be empty.
de: Palettenname darf nicht leer sein.
es: El nombre de la paleta no puede estar vacío.
fr: Le nom de la palette ne peut pas être vide.
it: Il nome della tavolozza non può essere vuoto.
pt: O nome da paleta não pode estar vazio.

# paletteNameHint
source: Ex: My work palette
de: Z.B.: Meine Arbeitspalette
es: Ej: Mi paleta de trabajo
fr: Ex : Ma palette de travail
it: Es: La mia tavolozza di lavoro
pt: Ex: Minha paleta de trabalho

# paletteNameLabel
source: Palette Name
de: Palettenname
es: Nombre de la Paleta
fr: Nom de la Palette
it: Nome Tavolozza
pt: Nome da Paleta

# paletteNameTooLongValidator
source: Name should not exceed 50 characters.
de: Name sollte 50 Zeichen nicht überschreiten.
es: El nombre no debe exceder los 50 caracteres.
fr: Le nom ne doit pas dépasser 50 caractères.
it: Il nome non deve superare i 50 caratteri.
pt: O nome não deve exceder 50 caracteres.

source: Palette of '{journalName}'
de: Palette von '{journalName}'
es: Paleta de '{journalName}'
fr: Palette de '{journalName}'
it: Tavolozza di '{journalName}'
pt: Paleta de '{journalName}'

# paletteSourceDropdownLabel
source: Choose palette source
de: Palettenquelle auswählen
es: Elegir origen de la paleta
fr: Choisir la source de la palette
it: Scegli origine tavolozza
pt: Escolher origem da paleta

# paletteSourceEmptyOption
source: Blank Palette (to compose)
de: Leere Palette (zum Erstellen)
es: Paleta en Blanco (para componer)
fr: Palette Vierge (à composer)
it: Tavolozza Vuota (da comporre)
pt: Paleta Vazia (para compor)

# paletteSourceExistingJournalOption
source: By copying palette from an existing journal
de: Durch Kopieren der Palette von einem vorhandenen Journal
es: Copiando paleta de un diario existente
fr: En copiant la palette d'un journal existant
it: Copiando la tavolozza da un diario esistente
pt: Copiando paleta de um jornal existente

# paletteSourceModelOption
source: From a palette model
de: Aus einem Palettenmodell
es: Desde un modelo de paleta
fr: À partir d'un modèle de palette
it: Da un modello di tavolozza
pt: De um modelo de paleta

# passwordLabel
source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
pt: Palavra-passe

# passwordValidationError
source: Please enter your password.
de: Bitte geben Sie Ihr Passwort ein.
es: Por favor, introduce tu contraseña.
fr: Veuillez entrer votre mot de passe.
it: Inserisci la tua password.
pt: Por favor, introduza a sua palavra-passe.

# pleaseChooseJournalValidator
source: Please choose a journal
de: Bitte wählen Sie ein Journal
es: Por favor, elige un diario
fr: Veuillez choisir un journal
it: Scegli un diario
pt: Por favor, escolha um jornal

# pleaseChooseModelValidator
source: Please choose a model
de: Bitte wählen Sie ein Modell
es: Por favor, elige un modelo
fr: Veuillez choisir un modèle
it: Scegli un modello
pt: Por favor, escolha um modelo

source: Portuguese
de: Portugiesisch
it: Portoghese
pt: Português

# portugueseBrazilian
source: Portuguese (Brazil)
de: Portugiesisch (Brasilien)
it: Portoghese (Brasile)
pt: Português (Brasil)

# predefinedModelsCannotBeDeletedSnackbar
source: Predefined models cannot be deleted.
de: Vordefinierte Modelle können nicht gelöscht werden.
es: Los modelos predefinidos no se pueden eliminar.
fr: Les modèles prédéfinis ne peuvent pas être supprimés.
it: I modelli predefiniti non possono essere eliminati.
pt: Os modelos predefinidos não podem ser eliminados.

# registerPageAlreadyHaveAccountLink
source: Already have an account? Sign In
de: Haben Sie bereits ein Konto? Anmelden
es: ¿Ya tienes una cuenta? Inicia Sesión
fr: Déjà un compte ? Se connecter
it: Hai già un account? Accedi
pt: Já tem uma conta? Iniciar Sessão

# registerPageConfirmPasswordLabel
source: Confirm Password
de: Passwort bestätigen
es: Confirmar Contraseña
fr: Confirmer le mot de passe
it: Conferma Password
pt: Confirmar Palavra-passe

# registerPageConfirmPasswordValidatorEmpty
source: Please confirm your password.
de: Bitte bestätigen Sie Ihr Passwort.
es: Por favor, confirma tu contraseña.
fr: Veuillez confirmer votre mot de passe.
it: Conferma la tua password.
pt: Por favor, confirme a sua palavra-passe.

# registerPageConfirmPasswordValidatorMismatch
source: Passwords do not match.
de: Passwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
fr: Les mots de passe ne correspondent pas.
it: Le password non coincidono.
pt: As palavras-passe não coincidem.

# registerPageDisplayNameLabel
source: Display Name
de: Anzeigename
es: Nombre para Mostrar
fr: Nom d'affichage
it: Nome Visualizzato
pt: Nome de Exibição

# registerPageDisplayNameValidatorEmpty
source: Please enter your display name.
de: Bitte geben Sie Ihren Anzeigenamen ein.
es: Por favor, introduce tu nombre para mostrar.
fr: Veuillez entrer votre nom d'affichage.
it: Inserisci il tuo nome visualizzato.
pt: Por favor, introduza o seu nome de exibição.

# registerPageDisplayNameValidatorTooShort
source: Display name must be at least 3 characters.
de: Anzeigename muss mindestens 3 Zeichen lang sein.
es: El nombre para mostrar debe tener al menos 3 caracteres.
fr: Le nom d'affichage doit comporter au moins 3 caractères.
it: Il nome visualizzato deve contenere almeno 3 caratteri.
pt: O nome de exibição deve ter pelo menos 3 caracteres.

# registerPageHeading
source: Join Colors & Notes
de: Colors & Notes beitreten
es: Únete a Colors & Notes
fr: Rejoignez Colors & Notes
it: Unisciti a Colors & Notes
pt: Junte-se ao Colors & Notes

# registerPagePasswordValidatorDigit
source: Password must contain at least one digit.
de: Passwort muss mindestens eine Ziffer enthalten.
es: La contraseña debe contener al menos un dígito.
fr: Le mot de passe doit contenir au moins un chiffre.
it: La password deve contenere almeno un numero.
pt: A palavra-passe deve conter pelo menos um dígito.

# registerPagePasswordValidatorEmpty
source: Please enter a password.
de: Bitte geben Sie ein Passwort ein.
es: Por favor, introduce una contraseña.
fr: Veuillez entrer un mot de passe.
it: Inserisci una password.
pt: Por favor, introduza uma palavra-passe.

# registerPagePasswordValidatorLength
source: Password must be at least 8 characters.
de: Passwort muss mindestens 8 Zeichen lang sein.
es: La contraseña debe tener al menos 8 caracteres.
fr: Le mot de passe doit contenir au moins 8 caractères.
it: La password deve contenere almeno 8 caratteri.
pt: A palavra-passe deve ter pelo menos 8 caracteres.

# registerPagePasswordValidatorLowercase
source: Password must contain at least one lowercase letter.
de: Passwort muss mindestens einen Kleinbuchstaben enthalten.
es: La contraseña debe contener al menos una letra minúscula.
fr: Le mot de passe doit contenir au moins une minuscule.
it: La password deve contenere almeno una lettera minuscola.
pt: A palavra-passe deve conter pelo menos uma letra minúscula.

# registerPagePasswordValidatorSpecialChar
source: Password must contain at least one special character (+-*_#=@%:$).
de: Passwort muss mindestens ein Sonderzeichen enthalten (+-*_#=@%:$).
es: La contraseña debe contener al menos un carácter especial (+-*_#=@%:$).
fr: Le mot de passe doit contenir au moins un caractère spécial (+-*_#=@%:$).
it: La password deve contenere almeno un carattere speciale (+-*_#=@%:$).
pt: A palavra-passe deve conter pelo menos um caractere especial (+-*_#=@%:$).

# registerPagePasswordValidatorUppercase
source: Password must contain at least one uppercase letter.
de: Passwort muss mindestens einen Großbuchstaben enthalten.
es: La contraseña debe contener al menos una letra mayúscula.
fr: Le mot de passe doit contenir au moins une majuscule.
it: La password deve contenere almeno una lettera maiuscola.
pt: A palavra-passe deve conter pelo menos uma letra maiúscula.

# registerPageSignUpButton
source: Sign Up & Sign In
de: Registrieren & Anmelden
es: Registrarse e Iniciar Sesión
fr: S'inscrire et se connecter
it: Registrati e Accedi
pt: Registar e Iniciar Sessão

# registerPageTitle
source: Create Account
de: Konto erstellen
es: Crear Cuenta
fr: Créer un compte
it: Crea Account
pt: Criar Conta

# reloadingInitialJournalMessage
source: Reloading initial journal after deleting active journal.
de: Ursprüngliches Journal nach dem Löschen des aktiven Journals neu laden.
es: Recargando diario inicial después de eliminar el diario activo.
fr: Rechargement du journal initial après suppression du journal actif.
it: Ricaricamento del diario iniziale dopo l'eliminazione del diario attivo.
pt: A recarregar o jornal inicial após eliminar o jornal ativo.

source: Save
de: Speichern
es: Guardar
fr: Sauvegarder
it: Salva
pt: Guardar

# saveBlockedColorInUseError
source: Save blocked: The color(s) '{colorTitles}' is/are used and cannot be deleted.
de: Speichern blockiert: Die Farbe(n) '{colorTitles}' wird/werden verwendet und kann/können nicht gelöscht werden.
es: Guardado bloqueado: El/los color(es) '{colorTitles}' está/n en uso y no se puede/n eliminar.
fr: Sauvegarde bloquée : La/les couleur(s) '{colorTitles}' est/sont utilisée(s) et ne peuvent être supprimées.
it: Salvataggio bloccato: Il/I colore/i '{colorTitles}' è/sono in uso e non possono essere eliminati.
pt: Gravação bloqueada: A(s) cor(es) '{colorTitles}' está/estão em uso e não pode(m) ser eliminada(s).

# saveButtonLabel
source: Save
de: Speichern
es: Guardar
fr: Sauvegarder
it: Salva
pt: Guardar

# saveNameButtonLabel
source: Save name
de: Name speichern
es: Guardar nombre
fr: Sauvegarder le nom
it: Salva nome
pt: Guardar nome

# savingInProgressSnackbar
source: Saving in progress, please wait...
de: Speichern läuft, bitte warten...
es: Guardando en progreso, por favor espera...
fr: Sauvegarde en cours, veuillez patienter...
it: Salvataggio in corso, attendere...
pt: A guardar, por favor aguarde...

source: Select Language
de: Sprache auswählen
es: Seleccionar Idioma
fr: Sélectionnez une langue
it: Seleziona Lingua
pt: Selecionar Idioma

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
pt: Definições

# signInButton
source: Sign In
de: Anmelden
es: Iniciar Sesión
fr: Se connecter
it: Accedi
pt: Iniciar Sessão

# signInEmailErrorLog
source: Email sign-in error: {errorDetails}
de: E-Mail-Anmeldefehler: {errorDetails}
es: Error de inicio de sesión con correo electrónico: {errorDetails}
fr: Erreur de connexion par e-mail : {errorDetails}
it: Errore di accesso con email: {errorDetails}
pt: Erro de início de sessão com email: {errorDetails}

# signInGoogleErrorLog
source: Google sign-in error: {errorDetails}
de: Google-Anmeldefehler: {errorDetails}
es: Error de inicio de sesión con Google: {errorDetails}
fr: Erreur de connexion Google : {errorDetails}
it: Errore di accesso con Google: {errorDetails}
pt: Erro de início de sessão com Google: {errorDetails}

# signInGoogleSuccessLog
source: Google sign-in attempt successful.
de: Google-Anmeldeversuch erfolgreich.
es: Intento de inicio de sesión con Google exitoso.
fr: Tentative de connexion Google réussie.
it: Tentativo di accesso con Google riuscito.
pt: Tentativa de início de sessão com Google bem-sucedida.

# signInPageTitle
source: Sign In
de: Anmelden
es: Iniciar Sesión
fr: Se connecter
it: Accedi
pt: Iniciar Sessão

# signInSuccessLog
source: Sign-in attempt successful for {email}
de: Anmeldeversuch erfolgreich für {email}
es: Intento de inicio de sesión exitoso para {email}
fr: Tentative de connexion réussie pour {email}
it: Tentativo di accesso riuscito per {email}
pt: Tentativa de início de sessão bem-sucedida para {email}

# signInWithGoogleButton
source: Sign In with Google
de: Mit Google anmelden
es: Iniciar Sesión con Google
fr: Se connecter avec Google
it: Accedi con Google
pt: Iniciar Sessão com Google

# signOutErrorPrefix
source: Error signing out:
de: Fehler beim Abmelden:
es: Error al cerrar sesión:
fr: Erreur lors de la déconnexion :
it: Errore durante la disconnessione:
pt: Erro ao terminar sessão:

# signOutErrorSnackbar
source: Sign out error: {errorDetails}
de: Abmeldefehler: {errorDetails}
es: Error al cerrar sesión: {errorDetails}
fr: Erreur de déconnexion : {errorDetails}
it: Errore di disconnessione: {errorDetails}
pt: Erro ao terminar sessão: {errorDetails}

# signUpErrorLog
source: Error during sign-up on RegisterPage: {errorDetails}
de: Fehler bei der Registrierung auf RegisterPage: {errorDetails}
es: Error durante el registro en RegisterPage: {errorDetails}
fr: Erreur lors de l'inscription sur RegisterPage : {errorDetails}
it: Errore durante la registrazione su RegisterPage: {errorDetails}
pt: Erro durante o registo em RegisterPage: {errorDetails}

# signUpSuccessLog
source: Sign-up successful for {email}
de: Registrierung erfolgreich für {email}
es: Registro exitoso para {email}
fr: Inscription réussie pour {email}
it: Registrazione riuscita per {email}
pt: Registo bem-sucedido para {email}

# sortByEventDateTooltip
source: Sort by event date
de: Nach Ereignisdatum sortieren
es: Ordenar por fecha de evento
fr: Trier par date d'événement
it: Ordina per data evento
pt: Ordenar por data do evento
