Repository: Stanworld80/Colors_Notes
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, it, pt

# sortByPaletteColorTooltip
source: Sort by palette color
de: Nach Palettenfarbe sortieren
es: Ordenar por color de paleta
fr: Trier par couleur de palette
it: Ordina per colore tavolozza
pt: Ordenar por cor da paleta

# sortDirectionAscending
source: (Ascending)
de: (Aufsteigend)
es: (Ascendente)
fr: (Ascendant)
it: (Ascendente)
pt: (Ascendente)

# sortDirectionDescending
source: (Descending)
de: (Absteigend)
es: (Descendente)
fr: (Descendant)
it: (Discendente)
pt: (Descendente)

# startByCreatingOneMessage
source: Start by creating one above.
de: Beginnen Sie, indem Sie oben eines erstellen.
es: Comienza creando uno arriba.
fr: Commencez par en créer un ci-dessus.
it: Inizia creandone uno qui sopra.
pt: Comece por criar um acima.

# step1JournalName
source: Journal Name
es: Nombre del Diario
fr: Nom du Journal
it: Nome del Diario
pt: Nome do Jornal

# step2PaletteConfiguration
source: Palette Configuration
de: Palettenkonfiguration
es: Configuración de la Paleta
fr: Configuration de la Palette
it: Configurazione Tavolozza
pt: Configuração da Paleta

source: Success
de: Erfolg
es: Éxito
fr: Succès
it: Successo
pt: Sucesso

source: Theme
de: Thema
es: Tema
fr: Thème
it: Tema
pt: Tema

# themeSettingsComingSoon
source: Theme settings are coming soon!
de: Theme-Einstellungen folgen in Kürze!
es: ¡La configuración del tema llegará pronto!
fr: Les paramètres de thème arrivent bientôt !
it: Impostazioni tema prossimamente!
pt: Definições de tema em breve!

# tooManyColorsValidator
source: Too many colors (max {maxAllowed} allowed).
de: Zu viele Farben (max. {maxAllowed} erlaubt).
es: Demasiados colores (máx. {maxAllowed} permitidos).
fr: Trop de couleurs (max {maxAllowed} autorisées).
it: Troppi colori (max {maxAllowed} consentiti).
pt: Demasiadas cores (máx. {maxAllowed} permitidas).

# typeDeleteHereLabel
source: Type DELETE here
de: Geben Sie hier DELETE ein
es: Escribe DELETE aquí
fr: Tapez DELETE ici
it: Digita DELETE qui
pt: Escreva ELIMINAR aqui

# userNotConnectedError
source: User not connected.
de: Benutzer nicht verbunden.
es: Usuario no conectado.
fr: Utilisateur non connecté.
it: Utente non connesso.
pt: Utilizador não ligado.

source: User not identified
de: Benutzer nicht identifiziert
es: Usuario no identificado
fr: Utilisateur non identifié
it: Utente non identificato
pt: Utilizador não identificado

# userNotIdentifiedSnackbar
source: User not identified.
de: Benutzer nicht identifiziert.
es: Usuario no identificado.
fr: Utilisateur non identifié.
it: Utente non identificato.
pt: Utilizador não identificado.

source: Version
es: Versión
it: Versione
pt: Versão

# versionDynamicText
source: Version {version} (Build {buildNumber})
es: Versión {version} (Compilación {buildNumber})
it: Versione {version} (Build {buildNumber})
pt: Versão {version} (Build {buildNumber})

# versionLoading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
pt: A carregar...

# versionPrefix
source: version :
es: versión :
it: versione :
pt: versão :

source: Version unavailable
de: Version nicht verfügbar
es: Versión no disponible
fr: Version indisponible
it: Versione non disponibile
pt: Versão indisponível

# viewAsGridTooltip
source: View as grid
de: Als Raster anzeigen
es: Ver como cuadrícula
fr: Afficher en grille
it: Visualizza come griglia
pt: Ver como grelha

# viewAsListTooltip
source: View as list
de: Als Liste anzeigen
es: Ver como lista
fr: Afficher en liste
it: Visualizza come elenco
pt: Ver como lista

# welcomeGuest
source: Welcome!
de: Willkommen!
es: ¡Bienvenido!
fr: Bienvenue !
it: Benvenuto/a!
pt: Bem-vindo(a)!

# welcomeUser
source: Welcome, {userName}!
de: Willkommen, {userName}!
es: ¡Bienvenido, {userName}!
fr: Bienvenue, {userName} !
it: Benvenuto/a, {userName}!
pt: Bem-vindo(a), {userName}!

# yesDeleteAllButtonLabel
source: YES, DELETE ALL
de: JA, ALLES LÖSCHEN
es: SÍ, ELIMINAR TODO
fr: OUI, TOUT SUPPRIMER
it: SÌ, ELIMINA TUTTO
pt: SIM, ELIMINAR TUDO

# yesDeleteAllNotesButtonLabel
source: YES, DELETE ALL NOTES
de: JA, ALLE NOTIZEN LÖSCHEN
es: SÍ, ELIMINAR TODAS LAS NOTAS
fr: OUI, SUPPRIMER TOUTES LES NOTES
it: SÌ, ELIMINA TUTTE LE NOTE
pt: SIM, ELIMINAR TODAS AS NOTAS

# cookieConsentTitle
source: Gestion des Cookies
de: Cookie-Einstellungen
es: Consentimiento de Cookies
fr: Consentement aux Cookies
it: Cookie Consent
pt: Consentimento de Cookies

# cookieConsentMessage
source: We use cookies to enhance your experience. Essential cookies are necessary for the website to function. Do you accept the use of analytical cookies to help us improve our services?
de: Wir verwenden Cookies, um Ihre Erfahrung zu verbessern. Essenzielle Cookies sind für den Betrieb der Website notwendig. Akzeptieren Sie Analyse-Cookies, um uns bei der Verbesserung unserer Dienste zu helfen?
es: Utilizamos cookies para mejorar su experiencia. Las cookies esenciales son necesarias para el funcionamiento del sitio. ¿Acepta las cookies analíticas para ayudarnos a mejorar nuestros servicios?
fr: Nous utilisons des cookies pour améliorer votre expérience. Les cookies essentiels sont nécessaires au fonctionnement du site. Acceptez-vous les cookies analytiques pour nous aider à améliorer nos services ?
it: We use cookies to improve your experience. Essential cookies are necessary for site operation. Do you accept analytics cookies to help us improve our services?
pt: Utilizamos cookies para melhorar a sua experiência. Os cookies essenciais são necessários para o funcionamento do site. Aceita cookies analíticos para nos ajudar a melhorar os nossos serviços?

# cookieConsentAcceptAll
source: Accept All
de: Alle akzeptieren
es: Aceptar Todo
fr: Tout Accepter
pt: Aceitar Todos

# cookieConsentDecline
source: Decline
de: Abbrechen
es: Rechazar Cookies de Análisis
fr: Refuser les Cookies d'Analyse
it: Decline Analytics
pt: Recusar Cookies de Análise

# cookieConsentSettings
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
pt: Configurações

source: help
de: Hilfe
es: Ayuda
fr: aide
it: Aiuto
pt: Ajuda

source: Build
es: Compilación

# emailLabel
source: Email
es: Correo Electrónico

# versionBuildFormat
source: v{version} (Build {buildNumber})
es: v{version} (Compilación {buildNumber})
