Repository: Stanworld80/Colors_Notes
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr, it, pt

source: About
de: Über
es: Acerca de
fr: À propos
it: Informazioni
pt: Sobre

# aboutColorsNotesTitle
source: About Colors & Notes
de: Über Colors & Notes
es: Acerca de Colors & Notes
fr: À propos de Colors & Notes
it: Informazioni su Colors & Notes
pt: Sobre Colors & Notes

# aboutLink
source: About
de: Über
es: Acerca de
fr: À Propos
it: Informazioni
pt: Sobre

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
pt: Adicionar

# addColorButtonLabel
source: Add Color
de: Farbe hinzufügen
es: Añadir Color
fr: Ajouter Couleur
it: Aggiungi Colore
pt: Adicionar Cor

# addColorGradientDialogTitle
source: Add Color/Gradient
de: Farbe/Farbverlauf hinzufügen
es: Añadir Color/Gradiente
fr: Ajouter Couleur/Dégradé
it: Aggiungi Colore/Gradiente
pt: Adicionar Cor/Gradiente

# addGradientButtonLabel
source: Add Gradient
de: Farbverlauf hinzufügen
es: Añadir Gradiente
fr: Ajouter Dégradé
it: Aggiungi Gradiente
pt: Adicionar Gradiente

# addNewColorGradientListTile
source: Add a new color/gradient
de: Neue Farbe/Farbverlauf hinzufügen
es: Añadir un nuevo color/gradiente
fr: Ajouter une nouvelle couleur/dégradé
it: Aggiungi un nuovo colore/gradiente
pt: Adicionar nova cor/gradiente

# allColorsDeletedFromEditorSnackbar
source: All colors have been removed from the current editing palette.
de: Alle Farben wurden aus der aktuellen Bearbeitungspalette entfernt.
es: Todos los colores han sido eliminados de la paleta de edición actual.
fr: Toutes les couleurs ont été supprimées de la palette en cours d'édition.
it: Tutti i colori sono stati rimossi dalla tavolozza corrente.
pt: Todas as cores foram removidas da paleta de edição atual.

# allNotesDeletedBeforeEmptyingPaletteLog
source: All notes in journal {journalId} were deleted before emptying the palette.
de: Alle Notizen im Journal {journalId} wurden vor dem Leeren der Palette gelöscht.
es: Todas las notas en el diario {journalId} fueron eliminadas antes de vaciar la paleta.
fr: Toutes les notes du journal {journalId} ont été supprimées avant de vider la palette.
it: Tutte le note nel diario {journalId} sono state eliminate prima di svuotare la tavolozza.
pt: Todas as notas no jornal {journalId} foram eliminadas antes de esvaziar a paleta.

# allNotesDeletedSnackbar
source: All notes have been deleted.
de: Alle Notizen wurden gelöscht.
es: Todas las notas han sido eliminadas.
fr: Toutes les notes ont été supprimées.
it: Tutte le note sono state eliminate.
pt: Todas as notas foram eliminadas.

# appDescription
source: This application allows you to organize your daily notes and thoughts by associating them with personalized colors, grouped into unique palettes for each journal.
de: Diese Anwendung ermöglicht es Ihnen, Ihre täglichen Notizen und Gedanken zu organisieren, indem Sie sie mit personalisierten Farben verknüpfen, die für jedes Journal in einzigartigen Paletten gruppiert sind.
es: Esta aplicación te permite organizar tus notas y pensamientos diarios asociándolos con colores personalizados, agrupados en paletas únicas para cada diario.
fr: Cette application vous permet d'organiser vos notes et pensées quotidiennes en les associant à des couleurs personnalisées, regroupées dans des palettes uniques pour chaque journal.
it: Questa applicazione ti permette di organizzare le tue note e pensieri quotidiani associandoli a colori personalizzati, raggruppati in tavolozze uniche per ogni diario.
pt: Esta aplicação permite-lhe organizar as suas notas e pensamentos diários, associando-os a cores personalizadas, agrupadas em paletas únicas para cada jornal.

# appSlogan
source: Color your day.
de: Färbe deinen Tag.
es: Colorea tu día.
fr: Colorez votre journée.
it: Colora la tua giornata.
pt: Dá cor ao teu dia.

# authErrorPrefix
source: Error: {errorMessage}
de: Fehler: {errorMessage}
fr: Erreur : {errorMessage}
it: Errore: {errorMessage}
pt: Erro: {errorMessage}

# authorInfo
source: Author: Stanislas Mathieu Eric Selle
de: Autor: Stanislas Mathieu Eric Selle
es: Autor: Stanislas Mathieu Eric Selle
fr: Auteur : Stanislas Mathieu Eric Selle
it: Autore: Stanislas Mathieu Eric Selle
pt: Autor: Stanislas Mathieu Eric Selle

# baseNameCannotBeEmptyValidator
source: Base name cannot be empty.
de: Basisname darf nicht leer sein.
es: El nombre base no puede estar vacío.
fr: Le nom de base ne peut pas être vide.
it: Il nome di base non può essere vuoto.
pt: O nome base não pode estar vazio.

# baseNameForColorGradientLabel
source: Base name for color/gradient
de: Basisname für Farbe/Farbverlauf
es: Nombre base para color/gradiente
fr: Nom de base pour la couleur/dégradé
it: Nome di base per colore/gradiente
pt: Nome base para cor/gradiente

# bottomNavHome
source: Home
de: Startseite
es: Inicio
fr: Accueil
pt: Início

# bottomNavJournals
source: Journals
de: Journale
es: Diarios
fr: Journaux
it: Diari
pt: Jornais

# bottomNavNotes
source: Notes
de: Notizen
es: Notas
it: Note
pt: Notas

# cancelButtonLabel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
pt: Cancelar

# cannotAddGradientMaxReachedError
source: Cannot add {gradientSteps} colors, palette maximum reached.
de: Kann {gradientSteps} Farben nicht hinzufügen, Palettenmaximum erreicht.
es: No se pueden añadir {gradientSteps} colores, se alcanzó el máximo de la paleta.
fr: Impossible d'ajouter {gradientSteps} couleurs, maximum de la palette atteint.
it: Impossibile aggiungere {gradientSteps} colori, massimo della tavolozza raggiunto.
pt: Não é possível adicionar {gradientSteps} cores, máximo da paleta atingido.

# changeJournalTooltip
source: Change active journal
de: Aktives Journal wechseln
es: Cambiar diario activo
fr: Changer de journal actif
it: Cambia diario attivo
pt: Mudar de jornal ativo

# chooseJournalAppBarTitle
source: Choose Journal
de: Journal auswählen
es: Elegir Diario
fr: Choisir un Journal
it: Scegli Diario
pt: Escolher Jornal

# chooseJournalTitle
source: Choose a journal
de: Wähle ein Journal
es: Elige un diario
fr: Choisir un journal
it: Scegli un diario
pt: Escolher um jornal

# chooseOrCreateJournalButton
source: Choose or create a journal
de: Journal auswählen oder erstellen
es: Elegir o crear un diario
fr: Choisir ou créer un journal
it: Scegli o crea un diario
pt: Escolher ou criar um jornal

# choosePaletteModelDropdownLabel
source: Choose a palette model
de: Palettenmodell auswählen
es: Elegir un modelo de paleta
fr: Choisir un modèle de palette
it: Scegli un modello di tavolozza
pt: Escolher um modelo de paleta

# colorDeletedSnackbar
source: "{colorTitle}" deleted.
de: "{colorTitle}" gelöscht.
es: "{colorTitle}" eliminado.
fr: "{colorTitle}" supprimé.
it: "{colorTitle}" eliminato.
pt: "{colorTitle}" eliminada.

# colorHexExistsError
source: This color (hex) already exists.
de: Diese Farbe (Hex) existiert bereits.
es: Este color (hex) ya existe.
fr: Cette couleur (hex) existe déjà.
it: Questo colore (esadecimale) esiste già.
pt: Esta cor (hex) já existe.

# colorInUseDeleteError
source: The color "{colorTitle}" is in use and cannot be deleted.
de: Die Farbe "{colorTitle}" wird verwendet und kann nicht gelöscht werden.
es: El color "{colorTitle}" está en uso y no se puede eliminar.
fr: La couleur "{colorTitle}" est utilisée et ne peut pas être supprimée.
it: Il colore "{colorTitle}" è in uso e non può essere eliminato.
pt: A cor "{colorTitle}" está em uso e não pode ser eliminada.

# colorTitleExistsError
source: This color title already exists.
de: Dieser Farbtitel existiert bereits.
es: Este título de color ya existe.
fr: Ce titre de couleur existe déjà.
it: Questo titolo di colore esiste già.
pt: Este título de cor já existe.

# colorsSectionHeader
source: Colors ({currentCount} / {maxCount}) :
de: Farben ({currentCount} / {maxCount}) :
es: Colores ({currentCount} / {maxCount}) :
fr: Couleurs ({currentCount} / {maxCount}) :
it: Colori ({currentCount} / {maxCount}) :
pt: Cores ({currentCount} / {maxCount}) :

source: Coming Soon
de: Demnächst verfügbar
es: Próximamente
fr: Bientôt disponible
it: Prossimamente
pt: Em breve

# confirmDeleteColorContent
source: Do you really want to delete the color "{colorName}"?
de: Möchten Sie die Farbe "{colorName}" wirklich löschen?
es: ¿Realmente quieres eliminar el color "{colorName}"?
fr: Voulez-vous vraiment supprimer la couleur "{colorName}" ?
it: Vuoi davvero eliminare il colore "{colorName}"?
pt: Tem a certeza que quer eliminar a cor "{colorName}"?

# confirmDeleteColorTitle
source: Confirm Deletion
de: Löschen bestätigen
es: Confirmar Eliminación
fr: Confirmer la Suppression
it: Conferma Eliminazione
pt: Confirmar Eliminação

# confirmDeleteDialogTitle
source: Confirm deletion
de: Löschen bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression
it: Conferma eliminazione
pt: Confirmar eliminação

# confirmDeleteNoteDialogContent
source: Do you really want to delete this note?
de: Möchten Sie diese Notiz wirklich löschen?
es: ¿Realmente quieres eliminar esta nota?
fr: Voulez-vous vraiment supprimer cette note ?
it: Vuoi davvero eliminare questa nota?
pt: Tem a certeza que quer eliminar esta nota?

# confirmDeletionButtonLabel
source: CONFIRM DELETION
de: LÖSCHEN BESTÄTIGEN
es: CONFIRMAR ELIMINACIÓN
fr: CONFIRMER LA SUPPRESSION
it: CONFERMA ELIMINAZIONE
pt: CONFIRMAR ELIMINAÇÃO

# confirmDeletionDialogContent
source: Are you sure? This action is irreversible.
de: Sind Sie sicher? Diese Aktion ist unwiderruflich.
es: ¿Estás seguro? Esta acción es irreversible.
fr: Êtes-vous sûr(e) ? Cette action est irréversible.
it: Sei sicuro? Questa azione è irreversibile.
pt: Tem a certeza? Esta ação é irreversível.

# confirmDeletionDialogTitle
source: Confirm Deletion?
de: Löschen bestätigen?
es: ¿Confirmar Eliminación?
fr: Confirmer la Suppression ?
it: Confermare l'eliminazione?
pt: Confirmar Eliminação?

# copyPaletteFromJournalDropdownLabel
source: Copy palette from an existing journal
de: Palette von einem vorhandenen Journal kopieren
es: Copiar paleta de un diario existente
fr: Copier la palette d'un journal existant
it: Copia tavolozza da un diario esistente
pt: Copiar paleta de um jornal existente

# copyrightText
source: Copyright Â© 2025
de: Copyright © 2025
es: Copyright © 2025
fr: Copyright © 2025
it: Copyright © 2025
pt: Copyright © 2025

# createFirstModelMessage
source: Create your first personal model by pressing the "+" button above.
de: Erstellen Sie Ihr erstes persönliches Modell, indem Sie oben auf die Schaltfläche "+" klicken.
es: Crea tu primer modelo personal presionando el botón "+" de arriba.
fr: Créez votre premier modèle personnel en appuyant sur le bouton "+" ci-dessus.
it: Crea il tuo primo modello personale premendo il pulsante "+" in alto.
pt: Crie o seu primeiro modelo pessoal premindo o botão "+" acima.

# createJournalButtonLabel
source: Create journal
de: Journal erstellen
es: Crear diario
fr: Créer le journal
it: Crea diario
pt: Criar jornal

# createJournalPageTitle
source: Create a new journal
de: Neues Journal erstellen
es: Crear un nuevo diario
fr: Créer un nouveau journal
it: Crea un nuovo diario
pt: Criar um novo jornal

# createNewJournalButton
source: Create a new journal
de: Neues Journal erstellen
es: Crear un nuevo diario
fr: Créer un nouveau journal
it: Crea un nuovo diario
pt: Criar um novo jornal

# createNewJournalCardLabel
source: Create a new journal
de: Neues Journal erstellen
es: Crear un nuevo diario
fr: Créer un nouveau journal
it: Crea un nuovo diario
pt: Criar um novo jornal

# createNewPersonalModelTooltip
source: Create a new personal model
de: Neues persönliches Modell erstellen
es: Crear un nuevo modelo personal
fr: Créer un nouveau modèle personnel
it: Crea un nuovo modello personale
pt: Criar novo modelo pessoal

# defaultColorTitle
source: Color
de: Farbe
fr: Couleur
it: Colore
pt: Cor

# defaultPaletteNameForJournal
source: Palette of {journalName}
de: Palette von {journalName}
es: Paleta de {journalName}
fr: Palette de {journalName}
it: Tavolozza di {journalName}
pt: Paleta de {journalName}

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
pt: Eliminar

# deleteAllButtonLabel
source: Delete All
de: Alle löschen
es: Eliminar Todo
fr: Tout Supprimer
it: Elimina Tutto
pt: Eliminar Tudo

# deleteAllColorsDialogTitle
source: Delete all colors?
de: Alle Farben löschen?
es: ¿Eliminar todos los colores?
fr: Supprimer toutes les couleurs ?
it: Eliminare tutti i colori?
pt: Eliminar todas as cores?

# deleteAllColorsJournalWarning
source: This will delete all colors from the palette of journal "{journalName}". WARNING: All notes in this journal will also be PERMANENTLY deleted.
de: Dadurch werden alle Farben aus der Palette des Journals "{journalName}" gelöscht. ACHTUNG: Alle Notizen in diesem Journal werden ebenfalls DAUERHAFT gelöscht.
es: Esto eliminará todos los colores de la paleta del diario "{journalName}". ADVERTENCIA: Todas las notas en este diario también serán eliminadas PERMANENTEMENTE.
fr: Cela supprimera toutes les couleurs de la palette du journal "{journalName}". ATTENTION : Toutes les notes de ce journal seront également DÉFINITIVEMENT supprimées.
it: Questo eliminerà tutti i colori dalla tavolozza del diario "{journalName}". ATTENZIONE: Anche tutte le note in questo diario saranno PERMANENTEMENTE eliminate.
pt: Isto irá eliminar todas as cores da paleta do jornal "{journalName}". ATENÇÃO: Todas as notas neste jornal também serão PERMANENTEMENTE eliminadas.

# deleteAllColorsModelWarning
source: Do you really want to delete all colors from this palette model?
de: Möchten Sie wirklich alle Farben aus diesem Palettenmodell löschen?
es: ¿Realmente quieres eliminar todos los colores de este modelo de paleta?
fr: Voulez-vous vraiment supprimer toutes les couleurs de ce modèle de palette ?
it: Vuoi davvero eliminare tutti i colori da questo modello di tavolozza?
pt: Tem a certeza que quer eliminar todas as cores deste modelo de paleta?

# deleteAllColorsTooltip
source: Delete all colors
de: Alle Farben löschen
es: Eliminar todos los colores
fr: Supprimer toutes les couleurs
it: Elimina tutti i colori
pt: Eliminar todas as cores

# deleteAllNotesDialogContent
source: This action will PERMANENTLY delete all notes in this journal. Do you want to continue?
de: Diese Aktion löscht DAUERHAFT alle Notizen in diesem Journal. Möchten Sie fortfahren?
es: Esta acción eliminará PERMANENTEMENTE todas las notas de este diario. ¿Quieres continuar?
fr: Cette action supprimera DÉFINITIVEMENT toutes les notes de ce journal. Voulez-vous continuer ?
it: Questa azione eliminerà PERMANENTEMENTE tutte le note in questo diario. Vuoi continuare?
pt: Esta ação irá eliminar PERMANENTEMENTE todas as notas deste jornal. Deseja continuar?

# deleteAllNotesDialogTitle
source: Delete all notes?
de: Alle Notizen löschen?
es: ¿Eliminar todas las notas?
fr: Supprimer toutes les notes ?
it: Eliminare tutte le note?
pt: Eliminar todas as notas?

# deleteAllNotesTooltip
source: Delete all notes in this journal
de: Alle Notizen in diesem Journal löschen
es: Eliminar todas las notas de este diario
fr: Supprimer toutes les notes de ce journal
it: Elimina tutte le note in questo diario
pt: Eliminar todas as notas neste jornal

# deleteButtonLabel
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
pt: Eliminar

# deleteJournalButtonLabel
source: Delete journal
de: Journal löschen
es: Eliminar diario
fr: Supprimer le journal
it: Elimina diario
pt: Eliminar jornal

# deleteJournalDialogContent
source: All notes in this journal will also be permanently deleted. This action is irreversible.
de: Alle Notizen in diesem Journal werden ebenfalls dauerhaft gelöscht. Diese Aktion ist unwiderruflich.
es: Todas las notas de este diario también serán eliminadas permanentemente. Esta acción es irreversible.
fr: Toutes les notes de ce journal seront également supprimées définitivement. Cette action est irréversible.
it: Anche tutte le note in questo diario saranno eliminate definitivamente. Questa azione è irreversibile.
pt: Todas as notas neste jornal também serão eliminadas permanentemente. Esta ação é irreversível.

# deleteJournalDialogTitle
source: Delete journal "{journalName}"?
de: Journal "{journalName}" löschen?
es: ¿Eliminar diario "{journalName}"?
fr: Supprimer le journal "{journalName}" ?
it: Eliminare il diario "{journalName}"?
pt: Eliminar o jornal "{journalName}"?

# deleteModelDialogContent
source: Do you really want to delete the palette model "{modelName}"? This action is irreversible.
de: Möchten Sie das Palettenmodell "{modelName}" wirklich löschen? Diese Aktion ist unwiderruflich.
es: ¿Realmente quieres eliminar el modelo de paleta "{modelName}"? Esta acción es irreversible.
fr: Voulez-vous vraiment supprimer le modèle de palette "{modelName}" ? Cette action est irréversible.
it: Vuoi davvero eliminare il modello di tavolozza "{modelName}"? Questa azione è irreversibile.
pt: Tem a certeza que quer eliminar o modelo de paleta "{modelName}"? Esta ação é irreversível.

# deleteModelDialogTitle
source: Delete Model?
de: Modell löschen?
es: ¿Eliminar Modelo?
fr: Supprimer le Modèle ?
it: Eliminare Modello?
pt: Eliminar Modelo?

# deleteModelTooltip
source: Delete model
de: Modell löschen
es: Eliminar modelo
fr: Supprimer le modèle
it: Elimina modello
pt: Eliminar modelo

# deleteNoteTooltipGrid
source: Delete note
de: Notiz löschen
es: Eliminar nota
fr: Supprimer la note
it: Elimina nota
pt: Eliminar nota

# deleteThisColorButtonLabel
source: Delete this color
de: Diese Farbe löschen
es: Eliminar este color
fr: Supprimer cette couleur
it: Elimina questo colore
pt: Eliminar esta cor

# deleteThisNoteTooltipList
source: Delete this note
de: Diese Notiz löschen
es: Eliminar esta nota
fr: Supprimer cette note
it: Elimina questa nota
pt: Eliminar esta nota

# developedWith
source: Developed with Flutter & Firebase.
de: Entwickelt mit Flutter & Firebase.
es: Desarrollado con Flutter & Firebase.
fr: Développé avec Flutter & Firebase.
it: Sviluppato con Flutter & Firebase.
pt: Desenvolvido com Flutter & Firebase.

# downloadForAndroidLink
source: Download for Android
de: Für Android herunterladen
es: Descargar para Android
fr: Télécharger pour Android
it: Scarica per Android
pt: Transferir para Android

source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
pt: Editar

# editColorDialogTitle
source: Edit Color
de: Farbe bearbeiten
es: Editar Color
fr: Modifier la Couleur
it: Modifica Colore
pt: Editar Cor

# editModelTooltip
source: Edit model
de: Modell bearbeiten
es: Editar modelo
fr: Modifier le modèle
it: Modifica modello
pt: Editar modelo

# editNameOptionsTooltip
source: Edit name / Options...
de: Name bearbeiten / Optionen...
es: Editar nombre / Opciones...
fr: Modifier le nom / Options...
it: Modifica nome / Opzioni...
pt: Editar nome / Opções...

# editPaletteForJournalTooltip
source: Edit palette for {journalName}
de: Palette für {journalName} bearbeiten
es: Editar paleta para {journalName}
fr: Modifier la palette de {journalName}
it: Modifica tavolozza per {journalName}
pt: Editar paleta para {journalName}

# editPaletteTooltip
source: Edit palette of '{journalName}'
de: Palette von '{journalName}' bearbeiten
es: Editar paleta de '{journalName}'
fr: Modifier la palette de '{journalName}'
it: Modifica tavolozza di '{journalName}'
pt: Editar paleta de '{journalName}'

# emailValidationError
source: Please enter a valid email address.
de: Bitte geben Sie eine gültige E-Mail-Adresse ein.
es: Por favor, introduce una dirección de correo electrónico válida.
fr: Veuillez entrer une adresse e-mail valide.
it: Inserisci un indirizzo email valido.
pt: Por favor, introduza um endereço de email válido.

# emptyButtonLabel
source: Empty
de: Leeren
es: Vaciar
fr: Vider
it: Svuota
pt: Esvaziar

# emptyPaletteDialogContent
source: Do you really want to remove all colors from this new palette?
de: Möchten Sie wirklich alle Farben aus dieser neuen Palette entfernen?
es: ¿Realmente quieres eliminar todos los colores de esta nueva paleta?
fr: Voulez-vous vraiment supprimer toutes les couleurs de cette nouvelle palette ?
it: Vuoi davvero rimuovere tutti i colori da questa nuova tavolozza?
pt: Tem a certeza que quer remover todas as cores desta nova paleta?

# emptyPaletteDialogTitle
source: Empty the palette?
de: Palette leeren?
es: ¿Vaciar la paleta?
fr: Vider la palette ?
it: Svuotare la tavolozza?
pt: Esvaziar a paleta?

source: English
de: Englisch
it: Inglese
pt: Inglês

# enterNumberValidator
source: Enter a number.
de: Geben Sie eine Nummer ein.
es: Introduce un número.
fr: Entrez un nombre.
it: Inserisci un numero.
pt: Introduza um número.

# entryPageAssociatedColorLabel
source: Associated Color
de: Zugehörige Farbe
es: Color Asociado
fr: Couleur associée
it: Colore Associato
pt: Cor Associada

# entryPageContentHint
source: Describe your thought, event, or task...
de: Beschreiben Sie Ihren Gedanken, Ihr Ereignis oder Ihre Aufgabe...
es: Describe tu pensamiento, evento o tarea...
fr: Décrivez votre pensée, événement, ou tâche...
it: Descrivi il tuo pensiero, evento o compito...
pt: Descreva o seu pensamento, evento ou tarefa...

# entryPageContentLabel
source: Note content...
de: Notizinhalt...
es: Contenido de la nota...
fr: Contenu de la note...
it: Contenuto della nota...
pt: Conteúdo da nota...

# entryPageContentValidatorEmpty
source: Please enter the note content.
de: Bitte geben Sie den Notizinhalt ein.
es: Por favor, introduce el contenido de la nota.
fr: Veuillez entrer le contenu de la note.
it: Inserisci il contenuto della nota.
pt: Por favor, introduza o conteúdo da nota.

# entryPageContentValidatorTooLong
source: Content is too long (max 1024 characters).
de: Inhalt ist zu lang (max. 1024 Zeichen).
es: El contenido es demasiado largo (máx. 1024 caracteres).
fr: Le contenu est trop long (max 1024 caractères).
it: Il contenuto è troppo lungo (max 1024 caratteri).
pt: O conteúdo é demasiado longo (máx. 1024 caracteres).

# entryPageDateTimeSetToNowSnackbar
source: Date and time set to now.
de: Datum und Uhrzeit auf jetzt gesetzt.
es: Fecha y hora establecidas a ahora.
fr: Date et heure réglées sur maintenant.
it: Data e ora impostate su adesso.
pt: Data e hora definidas para agora.

# entryPageEditTitle
source: Edit Note
de: Notiz bearbeiten
es: Editar Nota
fr: Modifier la Note
it: Modifica Nota
pt: Editar Nota

# entryPageGenericSaveError
source: Error: {errorMessage}
de: Fehler: {errorMessage}
fr: Erreur : {errorMessage}
it: Errore: {errorMessage}
pt: Erro: {errorMessage}

# entryPageJournalDetailsLoadError
source: Could not load journal details.
de: Journaldetails konnten nicht geladen werden.
es: No se pudieron cargar los detalles del diario.
fr: Impossible de charger les détails du journal.
it: Impossibile caricare i dettagli del diario.
pt: Não foi possível carregar os detalhes do jornal.

# entryPageJournalDetailsRetryButton
source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
pt: Tentar Novamente

# entryPageNewTitle
source: New Note
de: Neue Notiz
es: Nueva Nota
fr: Nouvelle Note
it: Nuova Nota
pt: Nova Nota

# entryPageNoColorSelectedError
source: Please select a color for the note.
de: Bitte wählen Sie eine Farbe für die Notiz.
es: Por favor, selecciona un color para la nota.
fr: Veuillez sélectionner une couleur pour la note.
it: Seleziona un colore per la nota.
pt: Por favor, selecione uma cor para a nota.

# entryPageNoteSavedAsNewSuccess
source: Note saved as new.
de: Notiz als neu gespeichert.
es: Nota guardada como nueva.
fr: Note sauvegardée comme nouvelle.
it: Nota salvata come nuova.
pt: Nota guardada como nova.

# entryPageNoteSavedSuccess
source: Note saved.
de: Notiz gespeichert.
es: Nota guardada.
fr: Note sauvegardée.
it: Nota salvata.
pt: Nota guardada.

# entryPageNoteUpdatedSuccess
source: Note updated.
de: Notiz aktualisiert.
es: Nota actualizada.
fr: Note mise à jour.
it: Nota aggiornata.
pt: Nota atualizada.
